{
  "candidate_name": "Jaideep Bommidi",
  "filename": "Jaideep_Bommidi.pdf",
  "overall_score": 86.15,
  "skill_match_score": 92.0,
  "experience_match_score": 85.0,
  "education_match_score": 90.0,
  "cultural_fit_score": 78.0,
  "keyword_density_score": 75.0,
  "matched_skills": [
    "Python",
    "PyTorch",
    "TensorFlow",
    "LLMs",
    "RAG",
    "SQL",
    "Spark",
    "Snowflake",
    "FastAPI",
    "Flask",
    "Django",
    "React.js",
    "AWS",
    "Azure",
    "GCP",
    "Terraform",
    "Docker",
    "Kubernetes",
    "NLP",
    "Computer Vision",
    "A/B testing"
  ],
  "missing_critical_skills": [],
  "missing_preferred_skills": [],
  "additional_skills": [
    "Shell Scripting",
    "Scikit-learn",
    "Keras",
    "time series (ARIMA, Prophet, VAR)",
    "FAISS",
    "CloudFormation",
    "REST",
    "CI/CD"
  ],
  "candidate_experience": {
    "total_years": 5.5,
    "positions": [
      {
        "title": "Machine Learning Engineer (AI Systems)",
        "company": "Webster Bank",
        "duration": "May 2025 – Current"
      }
    ],
    "companies": [
      "Webster Bank"
    ],
    "career_progression": "The candidate is currently a Machine Learning Engineer and has been in this role since May 2025. Prior experience includes roles focused on AI systems, indicating a progression within the field.",
    "relevant_experience_years": 4.0
  },
  "experience_gap": "Jaideep has 5.5 years of relevant experience, aligning well with the requirement for an AI Automation & Solutions Engineer. The experience spans across fintech, rail analytics and 3D printing which demonstrates adaptability.",
  "education": {
    "degrees": [
      "M.S",
      "Advanced Data Analytics"
    ],
    "institutions": [
      "University of North Texas"
    ],
    "fields_of_study": [
      "Data Analytics"
    ],
    "graduation_years": [
      2024
    ]
  },
  "education_match": "The M.S. in Advanced Data Analytics from the University of North Texas is a direct match for the educational requirements of this role.",
  "strengths": [
    "Strong proficiency in Python and relevant ML frameworks (PyTorch, TensorFlow).",
    "Deep expertise in LLMs, RAG, and retrieval systems.",
    "Proven ability to deliver impactful results with experience in churn prediction, defect detection, and real-time dashboards.",
    "Experience deploying AI systems on cloud platforms (AWS/Azure)."
  ],
  "weaknesses": [
    "Resume lacks specific details about experience with Copilot.",
    "Limited explicit mention of experience with API Databases."
  ],
  "red_flags": [],
  "recommendations": [
    "Probe further into Jaideep's experience with Copilot and API databases during the interview.",
    "Assess his understanding of the specific AI application suite used by Franklin Fitch."
  ],
  "suggested_interview_questions": [
    "Describe your experience with Copilot and how you've leveraged it to improve productivity.",
    "Walk me through a project where you designed and implemented an API database solution.",
    "Can you share an example of a time you had to make a trade-off between model accuracy and deployment latency?",
    "How do you stay up-to-date with the latest advancements in AI and automation?"
  ],
  "areas_to_probe": [
    "Specific technologies used within Franklin Fitch's AI application suite.",
    "Experience with agile development methodologies.",
    "Leadership experience or mentorship of junior engineers."
  ],
  "executive_summary": "Jaideep Bommidi is a highly qualified candidate with a strong background in AI and automation, possessing the technical skills and experience to excel as an AI Automation & Solutions Engineer. His expertise in LLMs, RAG, and cloud technologies aligns well with the job requirements. He has a solid academic foundation and a proven track record of delivering impactful results.",
  "hiring_recommendation": "YES - Strong match based on skills, experience, and education. Further interview is highly recommended to assess specific technical expertise and cultural fit.",
  "timestamp": "2025-11-07T16:17:23.125403"
}